Revit 2026 API

# CeilingCreate(Document, IListCurveLoop, ElementId, ElementId, Line, Double) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Ceiling Create(
	Document document,
	IList<CurveLoop> curveLoops,
	ElementId ceilingTypeId,
	ElementId levelId,
	Line slopeArrow,
	double slope
)
```
```vb
Public Shared Function Create (
	document As Document,
	curveLoops As IList(Of CurveLoop),
	ceilingTypeId As ElementId,
	levelId As ElementId,
	slopeArrow As Line,
	slope As Double
) As Ceiling
```
```cpp
public:
static Ceiling^ Create(
	Document^ document,
	IList<CurveLoop^>^ curveLoops,
	ElementId^ ceilingTypeId,
	ElementId^ levelId,
	Line^ slopeArrow,
	double slope
)
```
```fsharp
static member Create :
        document : Document *
        curveLoops : IList<CurveLoop> *
        ceilingTypeId : ElementId *
        levelId : ElementId *
        slopeArrow : Line *
        slope : float -> Ceiling
```

#### Parameters

document Document

curveLoops IListCurveLoop

ceilingTypeId ElementId

levelId ElementId

slopeArrow Line

slope Double

#### Return Value

Ceiling

#### Reference

Ceiling Class

Create Overload

Autodesk.Revit.DB Namespace